docs/artworks-wanted.org
* Artworks Wanted

Hello everyone! 👋 tg-focus's appearance now needs to be more
distinguishable. So I am looking for some beautiful artworks to
enhance the project’s appearance.

** What I Need 

/Icon/Logo/: I’m *specifically* looking for an icon or logo that
represents the essence of tg-focus. And it will be used as default
avatar for /TG-FOCUS/ group. It should be memorable, simple, and
reflect the main goal of the project: *focus*.

/Configuration Demonstrations/: Apart from the icon, I’d like series of
screenshots that capture the steps of process configuring tg-focus to
get it worked, just like the ones already emebbed in README's "A Simple Demo"
section, which are demonstrations in English.
I need **more other languages** (no more than 15 pics per language). 

** How You Can Contribute

*** Create Art

If you’re an artist, designer, or just someone with a
flair for creativity, I invite you to contribute your artwork! Whether
it’s a hand-drawn sketch, a digital masterpiece, or anything in
between, your work will be appreciated. 

*** Submit Your Art

To contribute, you can simply create an issue in this
repository and upload your artwork files. Feel free to provide a brief
description of your inspiration or the story behind your creation. 

*** License

By contributing, you agree to release your artwork under an
open source license (such as MIT, CC BY, or similar). This ensures
that others can freely use and modify your work while giving you
proper credit. 

** Recognition and Rewards

The project maintainer will pick the most appropriate one among all
candidates for each topic. Such process will be as /objective/ as
possible. And there will be credits and rewards for those authors.

*** Credits

I’ll prominently credit all artists whose work is included, in a
dedicated list. Your name (or GitHub account) will be featured
alongside the respective artwork .

*** Rewards

As a token of appreciation. A *3-month Telegram Premium* gift⭐⭐⭐
will be at least.


