docs/artworks-wanted.md

# Table of Contents

1.  [Artworks Wanted](#orgcf3c252)
    1.  [What I Need](#orgfa7341e)
    2.  [How You Can Contribute](#org3ac082f)
        1.  [Create Art](#org71cb7fc)
        2.  [Submit Your Art](#org7cafcdc)
        3.  [License](#org1b77629)
    3.  [Recognition and Rewards](#orgdbc2c9e)
        1.  [Credits](#org4d70f89)
        2.  [Rewards](#org2b5deef)


<a id="orgcf3c252"></a>

# Artworks Wanted

Hello everyone! 👋 tg-focus's appearance now needs to be more
distinguishable. So I am looking for some beautiful artworks to
enhance the project’s appearance.


<a id="orgfa7341e"></a>

## What I Need

*Icon/Logo*: I’m **specifically** looking for an icon or logo that
represents the essence of tg-focus. And it will be used as default
avatar for *TG-FOCUS* group. It should be memorable, simple, and
reflect the main goal of the project: **focus**.

*Configuration Demonstrations*: Apart from the icon, I’d like series of
screenshots that capture the steps of process configuring tg-focus to
get it worked, just like the ones already emebbed in README's "A Simple Demo"
section, which are demonstrations in English.
I need ****more other languages**** (no more than 15 pics per language). 


<a id="org3ac082f"></a>

## How You Can Contribute


<a id="org71cb7fc"></a>

### Create Art

If you’re an artist, designer, or just someone with a
flair for creativity, I invite you to contribute your artwork! Whether
it’s a hand-drawn sketch, a digital masterpiece, or anything in
between, your work will be appreciated. 


<a id="org7cafcdc"></a>

### Submit Your Art

To contribute, you can simply create an issue in this
repository and upload your artwork files. Feel free to provide a brief
description of your inspiration or the story behind your creation. 


<a id="org1b77629"></a>

### License

By contributing, you agree to release your artwork under an
open source license (such as MIT, CC BY, or similar). This ensures
that others can freely use and modify your work while giving you
proper credit. 


<a id="orgdbc2c9e"></a>

## Recognition and Rewards

The project maintainer will pick the most appropriate one among all
candidates for each topic. Such process will be as *objective* as
possible. And there will be credits and rewards for those authors.


<a id="org4d70f89"></a>

### Credits

I’ll prominently credit all artists whose work is included, in a
dedicated list. Your name (or GitHub account) will be featured
alongside the respective artwork .


<a id="org2b5deef"></a>

### Rewards

As a token of appreciation. A **3-month Telegram Premium** gift⭐⭐⭐
will be at least.

